# Pandas

In [1]:
import os
print(os.getcwd())
os.chdir('E:/code/5.DataAnalysisOfficial/data/pandas')
print(os.getcwd())

E:\code\5.DataAnalysisOfficial
E:\code\5.DataAnalysisOfficial\data\pandas

# file Read Write operation

In [2]:
import numpy as np
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
#pd.read_csv?

In [4]:
import pandas as pd

df = pd.read_csv('E:/code/5.DataAnalysisOfficial/data/pandas/ex1csv.csv')  # provide the file name (path)
df.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
draft2 = pd.read_table('test.tsv')           # Read a "tab separated values" into a DataFrame
draft2.head()

        test   test test.1 test.2 test.3
pawan  pawan  pawan  pawan  pawan  pawan
kumar  kumar  kumar  kumar  kumar  kumar

In [6]:
pd.read_table('ex1csv.csv', sep=',')                # here we are using "read_table" but passing sep=','

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

#### Ex2: adding column names

In [7]:
df1 = pd.read_csv('ex2.csv')
print(type(df1))
df1

<class 'pandas.core.frame.DataFrame'>

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [8]:
pd.read_csv('ex2.csv', header=None)    # by default header="infer"

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'score', 'message'])  # names always equals to columns if not NaN come into picture

   a   b   c  score message
0  1   2   3      4   hello
1  5   6   7      8   world
2  9  10  11     12     foo

In [ ]:
#!cat /E:/code/5.DataAnalysisOfficial/data/pandas/csv_mindex.csv    #linux commands

#### Ex3: Reading multiple indices(composite keys)

In [10]:
parsed = pd.read_csv('csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

#### Ex4:removing unwanted rows

In [11]:
#!cat /Users/pawankumarpuppala/Downloads/examples/ex4.csv
pd.read_csv('E:/code/5.DataAnalysisOfficial/data/pandas/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [12]:
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

#### Ex5: finding NaN columns

In [13]:
#!cat /E:/code/5.DataAnalysisOfficial/data/pandas/ex4.csv/ex5.csv
df = pd.read_csv('ex5.csv')         
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [14]:
pd.isnull(df)                  # where there is null values it prints true

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [15]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])    #where ever there is null values it will fill with NaN
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

#### Ex6: Read data from xlsx files

In [16]:
draft3 = pd.read_excel('file_example.xlsx',sheet_name='address') # Name of sheet to read from
draft3.head(6)

             OrderDate   Region      Rep    Item  Units  UnitCost   Total
0  2020-06-01 00:00:00     East    Jones  Pencil     95      1.99  189.05
1            1/23/2020  Central   Kivell  Binder     50     19.99  999.50
2  2020-09-02 00:00:00  Central  Jardine  Pencil     36      4.99  179.64
3            2/26/2020  Central     Gill     Pen     27     19.99  539.73
4            3/15/2020     West  Sorvino  Pencil     56      2.99  167.44
5  2020-01-04 00:00:00     East    Jones  Binder     60      4.99  299.40

#### Ex7: read data from Web Page

In [17]:
import pandas as pd

url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url
BB_data[0]
#BB_data[0].ix[:, 0:20].head(5)      # Check 5 rows (10 columns only)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

#### Note: if the data is not available in tabular format in html use soup library available in python

#### Ex8: pull data from github repository

In [18]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [19]:
titanic_train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
titanic_train[["Name","Pclass"]].head()

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

In [21]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [22]:
pd.options.display.max_rows = 10  # if you set then when we call head() then we will get total 10 rows

#### EX9:

In [23]:
result = pd.read_csv('ex6.csv')
result.head()

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [24]:
pd.read_csv('ex6.csv', nrows=6)  #same like head()

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q

In [25]:
#Loading massive amount of data normally.
chunk = pd.read_csv('ex6.csv', chunksize=10)   # according to memory
chunk

- We are interested is chunksize. Technically the number of rows read at a time in a file by pandas is referred to as chunksize. Suppose If the chunksize is 100 then pandas will load the first 100 rows. The object returned is not a data frame but a TextFileReader which needs to be iterated to get the data.
- The object returned is not a data frame but an iterator, to get the data will need to iterate through this object.

In [26]:
#for data in chunk:
   # print(data)

#### Ex10: Writing Data to Text Format

In [27]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
#!cat /Users/sudhanshukumar/Downloads/Ex5_customized.csv
data.to_csv('Ex5_customized.csv')

In [29]:
data.to_csv('Ex5_customized_by_sep.csv', sep='@')

In [30]:
import sys 
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [31]:
data.to_csv('Ex5_customized_without_index.csv', index=False, header=False)

In [32]:
data.to_csv('Ex5_customized_column.csv', index=False, columns=['a', 'b', 'c'])

#### EX11: date

In [33]:
#!cat /Users/pawankumar/Downloads/examples/tseries.csv
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [34]:
ts = pd.Series(data=np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [35]:
ts.to_csv('tseries.csv')

#### Ex12: Working with Delimited Formats

In [36]:
import csv
f = open('ex7.csv')
print(type(f))
reader = csv.reader(f)
reader

<class '_io.TextIOWrapper'>

In [37]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

- with conjugate

In [38]:
import csv

with open('ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [39]:
header, values = lines[0], lines[1:]

In [40]:
data_dict = {h: v for h, v in zip(header, zip(*values))}       #zip always returns tuples
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

#### Ex13: JSON Data(java script object notation): key-value

In [41]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

#### to convert str  to json format we use loads

In [42]:
import json                      #json data reader in google
result = json.loads(obj)
result                    # type(result)--> dict format

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

#### to convert json to str format we use dumps

In [43]:
asjson = json.dumps(result)
asjson                          # type(asjson) --> str

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [44]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [45]:
#!cat /Users/pawankumar/Downloads/examples/example.json

- read json data and return in df and write in json format

In [48]:
df = pd.read_json('example.json')
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [49]:
print(df.to_json())
print(df.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

#### Ex 14: Read data from XML and HTML: Web Scraping

In [50]:
tables = pd.read_html('E:/code/5.DataAnalysisOfficial/data/pandas/fdic_failed_bank_list.html')
#tables[0]
#len(tables)
single_table = tables[0]
single_table.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [51]:
close_timestamps = pd.to_datetime(single_table['Closing Date'])
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [52]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

# Binary Data Formats
- it is kind of a file which can serialize and deserialize
- when ever system trying to store the file into raw_format it always store in ser and deser
- serialize: object to binary file format
- deserializtion: binary file format to object

In [53]:
frame = pd.read_csv('E:/code/5.DataAnalysisOfficial/data/pandas/ex1csv.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [54]:
frame.to_pickle('E:/code/5.DataAnalysisOfficial/data/pandas/frame_pickle')

In [55]:
pd.read_pickle('E:/code/5.DataAnalysisOfficial/data/pandas/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [56]:
#!rm /Users/pawankumar/Downloads/examples/frame_pickle

#### Using HDF5 Format(Hadoop distributed file format)

In [64]:
frame = pd.DataFrame({'a': np.random.randn(100)})
frame.head()

          a
0  0.752019
1  1.584986
2 -2.111699
3 -0.217214
4  0.822225

In [65]:
store = pd.HDFStore('mydata.h5')   # to write data in HDF5 
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [66]:
store['obj1']

           a
0   0.752019
1   1.584986
2  -2.111699
3  -0.217214
4   0.822225
..       ...
95 -1.380387
96  0.565138
97 -0.530676
98 -0.192709
99 -1.607250

[100 rows x 1 columns]

In [67]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [68]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.752019
1  1.584986
2 -2.111699
3 -0.217214
4  0.822225

# Web APIs

In [69]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [70]:
data = resp.json()
#data
data[2]['user']

{'login': 'ozars',
 'id': 13993759,
 'node_id': 'MDQ6VXNlcjEzOTkzNzU5',
 'avatar_url': 'https://avatars.githubusercontent.com/u/13993759?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/ozars',
 'html_url': 'https://github.com/ozars',
 'followers_url': 'https://api.github.com/users/ozars/followers',
 'following_url': 'https://api.github.com/users/ozars/following{/other_user}',
 'gists_url': 'https://api.github.com/users/ozars/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/ozars/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/ozars/subscriptions',
 'organizations_url': 'https://api.github.com/users/ozars/orgs',
 'repos_url': 'https://api.github.com/users/ozars/repos',
 'events_url': 'https://api.github.com/users/ozars/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/ozars/received_events',
 'type': 'User',
 'site_admin': False}

In [71]:
import pandas as pd
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])    #fetching the particular columns
issues

,number,title,labels,state
0,41099,CLN: remove split_and_operate in Block.fillna,[],open
1,41098,Text gradient,[],open
2,41097,TYP: Fix typehints for ExtensionDtype,[],open
3,41096,DOC/CI: fix doc build with Python 3.9,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
4,41095,Backport PR #41092: CI/DOC: temporary pin envi...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
...,...,...,...,...
25,41066,REF: BaseGroupBy methods belong in GroupBy,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
26,41065,REF: make maybe_cast_result_dtype a WrappedCyt...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
27,41064,QST: DataFrame with freq of 2.5ms fails to plot,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
28,41062,BUG: df[frozenset] fails if (other) column nam...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,41061,BUG: GH39443 - categorical datetime concat,[],open

# Interacting with Databases

In [74]:
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database9.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists test")
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata5.sqlite')
con.execute(query)
con.commit()

In [75]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [76]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [77]:
cursor.description
pd.DataFrame(data = rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [78]:
#!/usr/bin/python

import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database9.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists grades1")
# Create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [79]:
db.commit()

In [80]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(103, 'James', 80)
(104, 'Cathy', 85)
(105, 'Kris', 95)
------------------------------------------------------------

In [81]:
results = db.execute("select * from grades1 where name = 'Gary' ")
for row in results: print(row)
print("-"* 60 )

(102, 'Gary', 90)
------------------------------------------------------------

In [82]:
results = db.execute("select * from grades1 where score >= 90 ")
for row in results:
    print(row)
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(105, 'Kris', 95)
------------------------------------------------------------

In [83]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)
print("-" * 60 )

('John', 99)
('Kris', 95)
('Gary', 90)
('Cathy', 85)
('James', 80)
------------------------------------------------------------

In [84]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)
print("-" * 60 )

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)
------------------------------------------------------------

In [85]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)